mafeiGitHub/stm32Mp3/main/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "memory.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"
#include "os/ethernetif.h"

#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_msc.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
#endif
#include "stm32F7_discovery_qspi.h"
#include "cLcd.h"
#include "cSd.h"
#include "../fatfs/fatFs.h"

#include "utils.h"

#include "widgets/cWidget.h"
#include "widgets/cRootContainer.h"
#include "widgets/cListWidget.h"
#include "widgets/cTextBox.h"
#include "widgets/cValueBox.h"
#include "widgets/cSelectText.h"
#include "widgets/cBmpWidget.h"
#include "widgets/cWaveCentreWidget.h"
#include "widgets/cWaveLensWidget.h"

#include "net/cLwipHttp.h"
#include "net/cUartEsp8266Http.h"
//#include "../httpServer/httpServer.h"
//#include "../httpServer/ftpServer.h"

#include "hls/hls.h"
#include "decoders/cMp3.h"
//}}}

#ifdef STM32F746G_DISCO
#else
  #define ESP8266
#endif

UART_HandleTypeDef DebugUartHandle;

const bool kSdDebug = false;
const bool kStaticIp = false;
const std::string kHello = "built " + std::string(__TIME__) + " on " + std::string(__DATE__);
//{{{  new, delete
//void* operator new (size_t size) { return pvPortMalloc (size); }
//void operator delete (void* ptr) { vPortFree (ptr); }
void* operator new (size_t size) { return malloc (size); }
void operator delete (void* ptr) { free (ptr); }

void* operator new[](size_t size) { return malloc (size); }
void operator delete[](void *ptr) { free (ptr); }
//}}}

//{{{
static const uint8_t SD_InquiryData[] = {
  0x00, 0x80, 0x02, 0x02, (24 - 5), 0x00, 0x00, 0x00,
  'C', 'o', 'l', 'i', 'n', ' ', ' ', ' ',                                         // Manufacturer: 8 bytes
  'S', 'D', ' ', 'd', 'i', 's', 'k', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', // Product     : 16 Bytes
  '0', '.', '9','9',                                                              // Version     : 4 Bytes
  };
//}}}
//{{{
static const USBD_StorageTypeDef USBD_DISK_fops = {
  SD_IsReady,
  SD_GetCapacity,
  SD_ReadCached,
  SD_WriteCached,
  (int8_t*)SD_InquiryData,
  };
//}}}
//{{{  static vars
static USBD_HandleTypeDef USBD_Device;

static SemaphoreHandle_t mAudSem;
static bool mAudHalf = false;
static int mIntVolume = 0;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;

// mp3
static int fileIndex = 0;
static bool fileIndexChanged = false;
static std::vector<std::string> mMp3Files;

static int mMp3PlayFrame = 0;
static bool mWaveLoad = false;
static bool mWaveChanged = false;
static int mWaveLoadFrame = 0;
static uint8_t* mWave = nullptr;
static int* mFrameOffsets = nullptr;

static float mMp3Volume = 0.9f;
static bool mMp3VolumeChanged = false;

// hls
static cHls* mHls;
static SemaphoreHandle_t mHlsSem;
static int16_t* mReSamples;
//}}}

//{{{  audio callbacks
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {

  mAudHalf = true;

  portBASE_TYPE taskWoken = pdFALSE;
  if (xSemaphoreGiveFromISR (mAudSem, &taskWoken) == pdTRUE)
    portEND_SWITCHING_ISR (taskWoken);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {

  mAudHalf = false;

  portBASE_TYPE taskWoken = pdFALSE;
  if (xSemaphoreGiveFromISR (mAudSem, &taskWoken) == pdTRUE)
    portEND_SWITCHING_ISR (taskWoken);
  }
//}}}
//}}}
//{{{
static void listDirectory (std::string directoryName, std::string ext) {

  debug ("dir " + directoryName);

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    cLcd::get()->info (COL_RED, "directory open error:"  + dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory())
      listDirectory (directoryName + "/" + fileInfo.getName(), ext);

    else if (fileInfo.matchExtension (ext.c_str())) {
      mMp3Files.push_back (directoryName + "/" + fileInfo.getName());
      //debug (fileInfo.getName());
      cFile file (directoryName + "/" + fileInfo.getName(), FA_OPEN_EXISTING | FA_READ);
      //debug ("- filesize " + cLcd::intStr (file.getSize()));
      }
    }
  }
//}}}

//{{{
static void hlsLoaderThread (void const* argument) {

  #ifdef ESP8266
    cUartEsp8266Http http;
  #else
    cLwipHttp http;
  #endif

  http.initialise();

  while (true) {
    if (mHls->mChanChanged)
      mHls->setChan (http, mHls->mHlsChan, mHls->mHlsBitrate);

    mHls->loadPicAtPlayFrame (http);
    if (!mHls->loadAtPlayFrame (http))
      vTaskDelay (500);

    xSemaphoreTake (mHlsSem, portMAX_DELAY);
    }
  }
//}}}
//{{{
static void hlsPlayerThread (void const* argument) {

  // 8192 = 1024 samplesPerFrame * 2 chans * 2 bytesPperSample * 2 swing buffers
  const int kAudioBuffer = 1024 * 2 * 2 * 2;
  memset ((void*)AUDIO_BUFFER, 0, kAudioBuffer);
  BSP_AUDIO_OUT_Play ((uint16_t*)AUDIO_BUFFER, kAudioBuffer);

  uint32_t seqNum = 0;
  uint32_t lastSeqNum = 0;
  uint32_t numSamples = 0;
  uint16_t scrubCount = 0;
  double scrubSample = 0;

  while (true) {
    if (xSemaphoreTake (mAudSem, 50) == pdTRUE) {
      int16_t* sample = nullptr;
      if (mHls->getScrubbing()) {
        if (scrubCount == 0)
          scrubSample = mHls->getPlaySample();
        sample = mHls->getPlaySamples (scrubSample + (scrubCount * kSamplesPerFrame), seqNum, numSamples);
        if (scrubCount++ > 3) {
          sample = nullptr;
          scrubCount = 0;
          }
        }
      else if (mHls->getPlaying()) {
        sample = mHls->getPlaySamples (mHls->getPlaySample(), seqNum, numSamples);
        if (sample)
          mHls->incPlayFrame (1);
        }

      if (sample)
        memcpy ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + kAudioBuffer/2), sample, kAudioBuffer/2);
      else
        memset ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + kAudioBuffer/2), 0, kAudioBuffer/2);

      if (mHls->mChanChanged || !seqNum || (seqNum != lastSeqNum)) {
        lastSeqNum = seqNum;
        xSemaphoreGive (mHlsSem);
        }
      }
    }
  }
//}}}
//{{{
static void hlsNetThread (void const* argument) {

  tcpip_init (NULL, NULL);
  debug ("hlsNetThread");

  // init LwIP stack
  struct ip_addr ipAddr;
  IP4_ADDR (&ipAddr, 192, 168, 1, 67);
  struct ip_addr netmask;
  IP4_ADDR (&netmask, 255, 255 , 255, 0);
  struct ip_addr gateway;
  IP4_ADDR (&gateway, 192, 168, 0, 1);

  struct netif netIf;
  netif_add (&netIf, &ipAddr, &netmask, &gateway, NULL, &ethernetif_init, &tcpip_input);
  netif_set_default (&netIf);

  if (!netif_is_link_up (&netIf)) {
    netif_set_down (&netIf);
    cLcd::get()->info (COL_RED, "no ethernet");
    }
  else {
    netif_set_up (&netIf);
    if (kStaticIp)
      //{{{  static ip
      cLcd::get()->info (COL_YELLOW, "ethernet static ip " + dec ((int) (netIf.ip_addr.addr & 0xFF)) + "." +
                                                      dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                                      dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                                      dec ((int) (netIf.ip_addr.addr >> 24)));
      //}}}
    else {
      //{{{  dhcp ip
      struct ip_addr nullIpAddr;
      IP4_ADDR (&nullIpAddr, 0, 0, 0, 0);
      netIf.ip_addr = nullIpAddr;
      netIf.netmask = nullIpAddr;
      netIf.gw = nullIpAddr;
      dhcp_start (&netIf);

      while (true) {
        if (netIf.ip_addr.addr) {
          // dhcp allocated
          std::string address = dec ( (int)(netIf.ip_addr.addr & 0xFF)) + "." +
                                dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                dec ( (int)(netIf.ip_addr.addr >> 24));
          cLcd::get()->info (COL_YELLOW, "dhcp " + address);

          dhcp_stop (&netIf);
          break;
          }
        else if (netIf.dhcp->tries > 4) {
          // dhcp timeout
          cLcd::get()->info (COL_RED, "dhcp timeout");
          dhcp_stop (&netIf);

