mafeiGitHub/stm32Mp3/main/main.cpp
                // read next chunks worth, including rest of frame, 32bit aligned
                int bytesLoaded;
                count++;
                FRESULT fresult = file.read (nextChunkPtr + bytesLeft, chunkSize, bytesLoaded);
                if (fresult) {
                  //{{{  error
                  debug ("play read " + dec (count) + " " + dec (fresult));
                  vTaskDelay (100);
                  goto exitPlay;
                  }
                  //}}}
                if (bytesLoaded) {
                  chunkPtr = nextChunkPtr;
                  bytesLeft += bytesLoaded;
                  }
                else
                  bytesLeft = 0;
                }
              if (bytesLeft >= mp3->getFrameBodySize()) {
                xSemaphoreTake (mAudSem, 100);
                auto frameBytes = mp3->decodeFrameBody (chunkPtr, nullptr, (int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER_HALF));
                if (frameBytes) {
                  chunkPtr += frameBytes;
                  bytesLeft -= frameBytes;
                  }
                else
                  bytesLeft = 0;
                mMp3PlayFrame++;
                }
              }
            if (mWaveChanged) {
              //{{{  seek new position
              file.seek (mFrameOffsets [mMp3PlayFrame] & 0xFFFFFFE0);
              mWaveChanged = false;
              headerBytes = 0;
              }
              //}}}
            } while (!fileIndexChanged && headerBytes && (bytesLeft > 0));
          }
        } while (!fileIndexChanged && (bytesLeft > 0));
      exitPlay:
      //}}}
      BSP_AUDIO_OUT_Stop (CODEC_PDWN_SW);
      }

    if (!fileIndexChanged)
      fileIndex = fileIndex >= (int)mMp3Files.size() ? 0 : fileIndex + 1;
    fileIndexChanged = false;
    }
  }
//}}}

//{{{
static void mainThread (void const* argument) {

  const bool kMaxTouch = 1;
  mLcd->displayOn();

  SD_Init();
  if (BSP_PB_GetState (BUTTON_WAKEUP) == GPIO_PIN_SET) {
    //{{{  usb sd MSC
    USBD_Init (&USBD_Device, &MSC_Desc, 0);
    USBD_RegisterClass (&USBD_Device, &USBD_MSC);
    USBD_MSC_RegisterStorage (&USBD_Device, (USBD_StorageTypeDef*)(&USBD_DISK_fops));
    USBD_Start (&USBD_Device);

    debug ("USB ok");
    }
    //}}}
  else if (SD_present()) {
    //{{{  sd MP3
    #ifdef STM32F746G_DISCO
      BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mMp3Volume * 100), 44100);
      BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
    #else
      //BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 44100);
      //BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
      BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mMp3Volume * 100), 44100);
      BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
    #endif


    mFrameOffsets = (int*)pvPortMalloc (60*60*40*sizeof(int));
    mWave = (uint8_t*)pvPortMalloc (60*60*40*2*sizeof(uint8_t));  // 1 hour of 40 mp3 frames per sec
    mWave[0] = 0;
    mWaveLoadFrame = 0;

    initMp3Menu (mRoot);
    mLcd->setShowDebug (false, false, false, true);  // disable debug - title, info, lcdStats, footer

    TaskHandle_t handle;
    xTaskCreate ((TaskFunction_t)mp3PlayThread, "mp3Play", 8192, 0, 3, &handle);
    }
    //}}}
  else {
    //{{{  net HLS
    #ifdef STM32F746G_DISCO
      BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mMp3Volume * 100), 48000);
      BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
    #else
      //BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 48000);
      //BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
      BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mMp3Volume * 100), 48000);
      BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
    #endif

    mReSamples = (int16_t*)pvPortMalloc (4096);
    memset (mReSamples, 0, 4096);

    mLcd->setShowDebug (false, false, false, false);  // debug - title, info, lcdStats, footer

    mHls = new cHls();
    hlsMenu (mRoot, mHls);

    vSemaphoreCreateBinary (mHlsSem);

    TaskHandle_t handle;
    #ifdef ESP8266
      xTaskCreate ((TaskFunction_t)hlsLoaderThread, "hlsLoad", 14000, 0, 3, &handle);
      xTaskCreate ((TaskFunction_t)hlsPlayerThread, "hlsPlay", 2000, 0, 4, &handle);
    #else
      xTaskCreate ((TaskFunction_t)hlsNetThread, "Net", 1024, 0, 3, &handle);
    #endif
    }
    //}}}

  //{{{  init vars
  int16_t x[kMaxTouch];
  int16_t y[kMaxTouch];
  uint8_t z[kMaxTouch];
  int pressed[kMaxTouch];
  for (auto touch = 0; touch < kMaxTouch; touch++)
    pressed[touch] = 0;
  //}}}
  BSP_TS_Init (mRoot->getPixWidth(), mRoot->getPixHeight());
  while (true) {
    //bool button = true;

    bool button = BSP_PB_GetState (BUTTON_WAKEUP) == GPIO_PIN_SET;
    TS_StateTypeDef tsState;
    BSP_TS_GetState (&tsState);
    for (auto touch = 0; touch < kMaxTouch; touch++) {
      if (touch < tsState.touchDetected) {
        //{{{  pressed
        auto xinc = pressed[touch] ? tsState.touchX[touch] - x[touch] : 0;
        auto yinc = pressed[touch] ? tsState.touchY[touch] - y[touch] : 0;
        x[touch] = tsState.touchX[touch];
        y[touch] = tsState.touchY[touch];
        z[touch] = tsState.touchWeight[touch];
        if (touch == 0)
          button ? mLcd->press (pressed[0], x[0], y[0], z[0], xinc, yinc) : mRoot->press (pressed[0], x[0], y[0], z[0], xinc, yinc);
        pressed[touch]++;
        }
        //}}}
      else {
        //{{{  released
        x[touch] = 0;
        y[touch] = 0;
        z[touch] = 0;
        if (!touch && pressed[0])
          mRoot->release();
        pressed[touch] = 0;
        }
        //}}}
      }

    #ifdef STM32F769I_DISCO
      //{{{  update led2,3
      button ? BSP_LED_On (LED2) : BSP_LED_Off (LED2);
      tsState.touchDetected ? BSP_LED_On (LED3) : BSP_LED_Off (LED3);
      //}}}
    #endif

    mLcd->startRender();
    button ? mLcd->clear (COL_BLACK) : mRoot->render (mLcd);
    //{{{  cursor
    //if (tsState.touchDetected)
    //  mLcd->renderCursor (COL_MAGENTA, x[0], y[0], z[0] ? z[0] : cLcd::getHeight()/10);
    //}}}
    if (kSdDebug)
      mLcd->text (COL_YELLOW, cWidget::getFontHeight(), SD_info(),
                  mLcd->getLcdWidthPix()/2, mLcd->getLcdHeightPix()- cWidget::getBoxHeight(),
                  mLcd->getLcdWidthPix(), cWidget::getBoxHeight());
    mLcd->endRender (button);

    if (mHls) {
      if (mHls->mVolumeChanged && (int(mHls->mVolume * 100) != mIntVolume)) {
        //{{{  set volume
        mIntVolume = int(mHls->mVolume * 100);
        BSP_AUDIO_OUT_SetVolume (mIntVolume);
        mHls->mVolumeChanged = false;
        }
        //}}}
      }
    else {
      if (mMp3VolumeChanged && (int(mMp3Volume * 100) != mIntVolume)) {
        //{{{  set volume
        mIntVolume = int(mMp3Volume * 100);
        BSP_AUDIO_OUT_SetVolume (mIntVolume);
        mMp3VolumeChanged = false;
        }
        //}}}
      }
    }
  }
//}}}

